from FallenMusic import BOT_NAME

PM_START_TEXT = """
ᴍᴇʀʜᴀʙᴀ {0}, 🥀
๏ ʙᴇɴɪᴍ ᴀᴅıᴍ** {1} !

➻ ʜıᴢʟı ᴠᴇ ɢᴜ̈ᴠᴇɴʟɪ ᴍᴜ̈ᴢɪᴋ ʙᴏᴛᴜ ᴏʟᴍᴀᴋ ᴛᴇᴋ ʜᴇᴅᴇғɪᴍ.
"""

START_TEXT = """
**ᴍᴇʀʜᴀʙᴀ** {0}, 🥀
  {1} ʜɪᴢᴍᴇᴛ ᴠᴇʀᴍᴇʏᴇ ʜᴀᴢıʀ. {2}.

──────────────────
➻ ᴅᴇsᴛᴇᴋ ᴠᴇ ʙɪʟᴅɪʀɪᴍ ɪᴄ̧ɪɴ ᴀɴıɴᴅᴀ ᴜʟᴀşᴀʙɪʟɪʀsɪɴɪᴢ [Yᴀʀᴅıᴍ Kᴀɴᴀʟı]({3}).
"""

HELP_TEXT = f"""
<u>❄ **ʜᴇʀ ᴋᴜʟʟᴀɴıᴄı ɪᴄ̧ɪɴ ᴋᴏᴍᴜᴛʟᴀʀ {BOT_NAME} :**</u>

๏ /oynat - /play : şᴀʀᴋı ᴏʏɴᴀᴛıʀ.
๏ /durdur - /pause : ʏᴀʏıɴı ᴅᴜʀᴀᴋʟᴀᴛıʀ.
๏ /devam - /resume : Yayını devam ettirir.
๏ /atla - /skip : ᴏ ᴀɴᴋɪ ᴘᴀʀᴄ̧ᴀʏı ᴀᴛʟᴀʀ.
๏ /son - /end : ʏᴀʏıɴı sᴏɴʟᴀɴᴅıʀıʀ.

๏ /ping : ᴘɪɴᴋ ᴠᴇ sɪsᴛᴇᴍ ɪsᴛᴀᴛɪsᴛɪᴋʟᴇʀɪɴɪ ɢᴏ̈sᴛᴇʀɪʀ.
๏ /bul : ᴘᴀʀᴄ̧ᴀ ɪɴᴅɪʀɪʀ ᴠᴇ sɪᴢᴇ ᴏ̈ᴢᴇʟᴅᴇɴ ɢᴏ̈ɴᴅᴇʀɪʀ.
๏ /search : ʏᴏᴜᴛᴜʙᴇ ᴜ̈ᴢᴇʀɪɴᴅᴇ ᴀʀᴀᴍᴀ ʏᴀᴘᴀʀ.
"""

HELP_SUDO = f"""
<u>❄ **İꜱᴛɪꜰᴀᴅƏÇɪʟƏʀ ÜÇÜɴ ᴍÖᴠᴄᴜᴅ ƏᴍʀʟƏʀ {BOT_NAME} :**</u>

๏ /play : ꜱƏꜱʟɪ Çᴀᴛᴅᴀ ᴍᴜꜱɪQɪ ʙᴀŞʟᴀᴅɪʀ.
๏ /pause : ᴄᴀʀɪ İꜰᴀʏᴀ ꜰᴀꜱɪʟƏ ᴠᴇʀɪʀ.
๏ /resume : ᴅᴀʏᴀɴᴅɪʀɪʟᴍɪŞ ʏᴀʏɪᴍɪ ᴅᴀᴠᴀᴍ ᴇᴛᴅɪʀɪɴ.
๏ /skip : ᴄᴀʀɪ İꜰᴀ ᴀxɪɴɪɴɪ ᴀᴛʟᴀʏɪɴ ᴠƏ ɴÖᴠʙƏᴅƏ ᴏʟᴀɴ ᴛʀᴇᴋɪ ʏᴀʏɪᴍʟᴀᴍᴀĞᴀ ʙᴀŞʟᴀʏᴀʀ.
๏ /end : ᴄᴀʀɪ İꜰᴀ ᴀxɪɴɪɴɪ ʙɪᴛɪʀƏʀ.

๏ /ping : ʙᴏᴛᴜɴ ᴘɪɴɢ ᴠƏ ꜱɪꜱᴛᴇᴍ ꜱᴛᴀᴛɪꜱᴛɪᴋᴀꜱɪɴɪ ɢÖꜱᴛƏʀɪʀ.
๏ /song : İꜱᴛƏᴅɪʏɪɴɪᴢ ᴍᴀʜɴɪɴɪ ʏÜᴋʟƏʏɪʀ ᴠƏ ꜱɪᴢƏ ɢÖɴᴅƏʀɪʀ.
๏ /search : ᴠᴇʀɪʟƏɴ ꜱᴏʀĞᴜɴᴜ ʏᴏᴜᴛᴜʙᴇ-ᴅᴀ ᴀxᴛᴀʀɪʀ ᴠƏ ɴƏᴛɪᴄƏɴɪ ꜱɪᴢƏ ɢÖꜱᴛƏʀɪʀ.
"""

HELP_DEV = f"""
<u>✨ **sᴀʜɪᴘ ɪᴄ̧ɪɴ ᴋᴏᴍᴜᴛʟᴀʀ {BOT_NAME} :**</u>

๏ /config : ʙᴏᴛᴜɴ ᴛᴜ̈ᴍ ʏᴀᴘıʟᴀɴᴅıʀᴍᴀ ᴅᴇɢ̆ɪşᴋᴇɴʟᴇʀɪɴɪ ɪʟᴇᴛɪʀ.
๏ /duyuru [ᴍᴇsᴀᴊ ʏᴀᴢıɴ ᴠᴇʏᴀ ʏᴀɴıᴛʟᴀʏıɴ] : ᴍᴇsᴀᴊı ʙᴏᴛᴜɴ ʜɪᴢᴍᴇᴛ ᴠᴇʀᴅɪɢ̆ɪ sᴏʜʙᴇᴛʟᴇʀᴇ ɪʟᴇᴛɪʀ.
๏ /rmdownloads : ʙᴏᴛᴜɴ sᴜɴᴜᴄᴜsᴜɴᴀ ɪɴᴅɪʀɪʟᴇɴ ᴄᴀᴄʜᴇ ᴅᴏsʏᴀʟᴀʀı ᴛᴇᴍɪᴢʟᴇʀ.
๏ /leaveall : ᴀsɪsᴛᴀɴı ᴛᴜ̈ᴍ sᴏʜʙᴇᴛʟᴇʀᴅᴇɴ ᴄ̧ıᴋᴀʀıʀ

๏ /aktifses : şᴜ ᴀɴᴅᴀ ᴀᴋᴛɪғ sᴇsʟɪ sᴏʜʙᴇᴛʟᴇʀɪɴ ʟɪsᴛᴇsɪɴɪ ɢᴏ̈sᴛᴇʀɪʀ.
๏ /eval or /sh : ᴠᴇʀɪʟᴇɴ ᴋᴏᴅᴜ ʙᴏᴛᴜɴ ᴛᴇʀᴍɪɴᴀʟɪɴᴅᴇ ᴄ̧ᴀʟışᴛıʀıʀ.
๏ /speedtest : ʙᴏᴛᴜɴ sᴜɴᴜᴄᴜsᴜɴᴅᴀ ʜıᴢ ᴛᴇsᴛɪ ʏᴀᴘᴀʀ
๏ /stats : sɪsᴛᴇᴍ ɪsᴛᴀᴛɪsᴛɪᴋʟᴇʀɪɴɪ ɢᴏ̈sᴛᴇʀɪʀ

๏ /setname [ᴛᴇxᴛ ᴏʀ ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴛᴇxᴛ] : ᴀsɪsᴛᴀɴ ʜᴇsᴀᴘ ᴀᴅıɴı ᴅᴇɢ̆ɪşᴛɪʀɪɴ.
๏ /setbio [ᴛᴇxᴛ ᴏʀ ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴛᴇxᴛ] : ᴀsɪsᴛᴀɴ ʜᴇsᴀᴘ ʙɪᴏsᴜɴᴜ ᴅᴇɢ̆ɪşᴛɪʀɪɴ.
๏ /setpfp [ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴘʜᴏᴛᴏ] : ᴀsɪsᴛᴀɴ ʜᴇsᴀᴘ ɪᴄ̧ɪɴ ᴘʀᴏғɪʟ ᴀʏᴀʀʟᴀʏıɴ.
๏ /delpfp : ᴀsɪsᴛᴀɴ ʜᴇsᴀʙıɴ ᴘʀᴏғɪʟɪɴɪ sɪʟɪɴ.
"""
